---
type: AreaTag
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# AreaTag

`Autodesk.Revit.DB.AreaTag` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Area | — | `public Area Area { get ; }` |
| Property | AreaTagType | — | `public AreaTagType AreaTagType { get ; set ; }` |
| Property | Parameter | — | `` |